{
    "timeData":{
        "slideshow":15000,
        "timeout":30000,
        "quitout":10000,
        "message":{
            "header":"Are you still there?",
            "body":"Please touch the screen in "
        },
        "videotimer":10000
    },
    
    "title":{
        "sustainable":{
            "header":"Sustainable Supercomputing",
            "memo":"Supercomputers have large appetites for electricity and cooling, but smarter design and support strategies are making even the largest of these simulation powerhouses more sustainable.  Read more about how LANL and the supercomputing community are responding to the need for greater sustainability, while still pushing the performance envelope.",
            "banner":"See how supercomputers drive a sustainable future"
        },
        "drive":{
            "header":"Supercomputers Drive Sustainablilty",
            "memo":"Supercomputers play an invaluable role in driving sustainability through research and simulations that provide us with solutions to build a sustainable future.  Learn more about how supercomputers are finding solutions to the world's most pressing challenges.",
            "banner":"Sustainable supercomputing"
        },
        "tubie":{
            "header":"How is it connected to \nsupercomputers and the \nsimulation capabilities they provide? ",
            "body":"\"Sustainability\" is about finding ways to meet our needs in the present without compromising the ability of future generations to meet their own needs.  It's a single term that encompasses a range of technical and social challenges—and also the opportunities we create—to improve the quality of our lives and those who will follow after us.  Explore this panel to discover more about how supercomputers play an important part in creating a sustainable future."
        },
        "slideshow":[
                {
                    "img":"data/slideshowImages/CoolingTrinity.jpg",
                    "position":"bottom"
                },
                {
                    "img":"data/slideshowImages/InstallingRoadrunner.jpg"
                },
                {
                    "img":"data/slideshowImages/WiringTrinityCluster.jpg"
                }
			]
    },
    
	"sustainable": {
        "header":"Sustainable Supercomputing",
        "slides": 
            [
				{
				"title": "Green Destiny",
				"header": "In 2003, sustainable computing was still a novel concept, but LANL computer scientists Wu-chun Feng, Eric Weigle, and Michael Warren were ahead of the curve.",
                "body": "They created an experimental, sustainable cluster computer called \"Green Destiny\" using energy-efficient processors and a fault-tolerant design that eliminated the need for the costly cooling systems found on other supercomputers.\n\nDespite being as powerful as a high-end supercomputer of just a few years before, Green Destiny used only as much electricity as two hairdryers.\n\nGreen Destiny was a successful proof-of-concept for energy-saving features that found their way into mainstream supercomputers, winning the coveted R&D 100 Award for innovation in science and technology in the process.",
				"featuredMedia": { 
					"src": "data/sustain/greendestiny-2.jpg",
                    "caption": "Los Alamos National Laboratory's Green Destiny sustainable cluster computer.",
                    "title":"Inventing sustainable supercomputing"
				    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"How have the technologies important to you become more efficient over time?"
                    }
                },
                {
				"title": "Roadrunner",
                "header": "In 2008, the Roadrunner supercomputer proved that performance did not have to mean sacrificing energy efficiency.",
				"body": "Co-designed by LANL and IBM, Roadrunner was equipped with multiple kinds of processing chips, rather than the usual single type of microprocessor.  This made Roadrunner the first large \"hybrid\" supercomputer, an approach considered \"radical\" at the time.  \n\nWith careful programming, Roadrunner used the chip best suited for a task; either its conventional AMD microprocessors—like those in a desktop computer—or its energy-efficient \"Cell\" accelerator chips from IBM—similar to the Cell chip found in the Sony Playstation 3.  \n\nThis \"hybrid\" approach made Roadrunner the fastest in the world, and extremely efficient, using only 1/3 of the power of equivalent, non-hybrid supercomputers.  \n\nAfter Roadrunner pioneered the concept, hybrid supercomputers have since become the norm.",
		        "video": "data/videos/RoadrunnerSupercomputerBreaks.mp4",
                "captions":[
                    {"file": "data/captions/Oceans_eng.vtt",
                     "label":"English",
                     "lang":"en"},
                    {"file": "data/captions/Oceans_eng.vtt",
                     "label":"French",
                     "lang":"fr"}
                ],
                "videoTitle":"Roadrunner Supercomputer Breaks the Petaflop Barrier",
                "featuredMedia": {
		           	"src": "data/sustain/anefficientrevolution-1.jpg",
		           	"caption": "The Cell accelerator chip helped LANL's Roadrunner break speed and efficiency records.",
                    "title":"An Efficient Revolution"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"Can you think of other commonplace ways of doing things today that were once considered \"radical\"?"
                    }
                },
                {
                "title": "Sanitary Effluent Reclamation Facility",
                "header": "Cooling towers for the supercomputers of the Strategic Computing Center account for a large proportion of the total water used at the lab.",
                "body": "To conserve the limited water supply of arid Northern New Mexico, reclaimed water from across the Lab is cleaned and filtered through the Sanitary Effluent Reclamation Facility (SERF).  Water from SERF supplies almost 100% of Los Alamos National Labs’ cooling tower demand, and allows the same water to be reused up to four times.",
				"video": "data/videos/SavingWaterLosAlamosNationalLaboratory.mp4",
                "videoTitle":"Saving Water at Los Alamos National Laboratory",
                "featuredMedia": {
		           	"src": "data/sustain/SERF.jpg",
                    "title":"Keeping cool while conserving water"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What other limited resources can be reused rather than discarded?"
                    }
		        },
                {
                "title": "Advanced RISC Machine (ARM)",
                "header": "The popularity of smartphones and portable electronics means that chip makers have invested vast sums into making processing chips that are powerful and energy efficient.",
                "body": "One type of chip in particular, the Advanced RISC Machine or \"ARM\" chip, was already found in a variety of mobile devices, from Android phones to inexpensive Raspberry Pi computers.  \n\nNow, the ARM chips that make the smallest computers so capable are making the largest computers more energy efficient.  In November 2019, Cray and Fujitsu partnered to produce the first-ever commercial supercomputer powered by an ARM-based processor, pushing the envelope of supercomputer performance, while reducing the environmental impact.  \n\nThe first customers, including Los Alamos and Oak Ridge National Laboratory, quickly signed up to take advantage of this alliance between highly efficient computing and high-performance computing.",
                "featuredMedia": {
		           	"src": "data/sustain/fujitsu-arm.jpg",
                    "title":"Efficient and high-performance computing",
                    "caption":"The Fujitsu A64FX ARM processor powered the first commercially available ARM-based supercomputer."
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other instances where improvements in one technology has benefited another?"
                    }
		        }
            ],
        "didYouKnow":
            [
                {
                "title":"Green500 List",
                "header":"...In 2007, Los Alamos computer scientist Wu-chun Feng and his colleague Kirk. W. Cameron at Virginia Tech created the Green500 List?",
                "body":"The Green500 List ranked supercomputers around the world based on their energy efficiency, bringing a shared set of sustainability assessment tools and criteria to the high-performance computing community.  \n\nThe List made it easier for supercomputer users and manufacturers alike to consider a machine's performance versus its energy-consumption when purchasing or designing new supercomputer systems.",
                "featuredMedia":{
                    "src": "data/sustain/green500.jpg"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"How do individuals and communities sharing knowledge about the efficiency of products help everyone make more informed decisions about sustainability?"
                    }
                },
                {
                "title":"Cosmic rays and supercomputers",
                "header":"Los Alamos used the high-energy beam from LANSCE (the Los Alamos Neutron Science Center) to shoot running processor boards taken from Roadrunner?",
                "body":"The results helped Lab computer experts better identify and mitigate the effects of cosmic rays on full-scale supercomputers, preventing wasteful computer downtime and errors.",
                "video": "data/videos/ProbingCosmicCauses.mp4",
                "videoTitle":"Probing the Cosmic Causes of Errors in Supercomputers",
                "featuredMedia":{
                    "src": "data/sustain/cosmicrays.jpg"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other instances where being better informed has meant reducing waste?"
                    }
                },
                {
                "title":"BitScope Raspberry Pi cluster",
                "header":"Gary Grider, leader of the Lab's High-Performance Computing Division, came up with the idea of creating a cluster of 750 Raspberry Pi computers as a “pilot cluster” to develop scalable systems software for the Trinity supercomputer?",
                "body":"This test-bed cluster let the Lab’s supercomputing experts replicate the extreme scale of Trinity, while only using 4,000 watts of electricity!  Grider said, “The Raspberry Pi modules let developers figure out how to write this software and get it to work reliably without having a dedicated testbed of the same size, which would cost a quarter billion dollars and use 25 megawatts of electricity.",
                "video": "data/videos/AffordableSupercomputingTestbed.mp4",
                "videoTitle":"An Affordable Supercomputing Testbed Based on Raspberry Pi",
                "featuredMedia":{
                    "src": "data/sustain/bitscope-2.jpg"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other creative solutions that have made it possible to do the same work, while using fewer resources?"
                    }
                },
                {
                "title":"Roadrunner",
                "header":"...LANL's powerful and efficient Roadrunner was the fastest supercomputer in the world on the Top500 List benchmarking site while, at the same time, it was the most power-efficient large computer on the Green500 List?",
                "body":"Roadrunner only lost the top spot on the Green500 List to a much-smaller computer that likewise ran on the same \"hybrid\" architecture as Roadrunner.",
                "featuredMedia":{
                    "src": "data/sustain/roadrunner.jpg"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"How does simultaneously seeking greater usefulness and efficiency from a technology help to spark innovation?"
                    }
                }
            ]
    },
    
    "drive":{
        "header":"Supercomputers Drive Sustainablilty",
        "slides":[
             {
                 "title": "FEARCE software",
                 "header":"There are over 250 million internal-combustion-engine vehicles in the United States alone.",
                 "body": "The Fast, Easy, Accurate, and Robust Continuum Engineering (FEARCE) software developed at Los Alamos is a cost-effective near- to mid-term sustainability solution that helps automotive engineers improve and optimize engine designs through computer modeling.  \n\nBecause the FEARCE software allows engineers to simulate how possible design changes impact the efficiency of an engine (without having to build the engine in the real world), new, more efficient engines can be developed in much less time, and for lower cost.",
                 "video": "data/videos/FEARCE.mp4",
                 "videoTitle":"FEARCE - Fast, Easy, Accurate & Robust Continuum Engineering",
		          "featuredMedia": {
		              "src": "data/drive/engine.jpg",
		              "caption": "Computer simulations allow automotive engineers to develop more efficient engines by modeling what will happen inside an engine that does not yet exist.",
                      "title":"Better Engines Through Better Software?"
		          },
                  "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other, older technologies that have been given new life through a better understanding of how they work?"
                    }
		      },
		     {
                  "title": "Carbon capture SimCCS software",
                  "header":"Converting carbon-dioxide emissions into a liquid and burying it deep underground has, for a long time, been an alternative to releasing greenhouse gases into the atmosphere.",
                  "body": "Carbon capture has struggled to become economically viable.  Linking up carbon producers, like power plants and other industries, with places geologically suitable for storing the carbon underground was the biggest hurdle, until now.  \n\nThe SimCCS software, developed and distributed for free by Los Alamos, uses computer models to identify and link together the carbon sources, pipelines, and storage sinks that need to find one another.  \n\nBy being able to turn a profit from selling the carbon dioxide they produce, commercial and government agencies are incentivized to capture and dispose of greenhouse gases safely.",
                  "video": "data/videos/RemovingCO2.mp4",
                  "videoTitle":"Removing CO2 from the atmosphere with the help of software",
				  "featuredMedia": {
		              "src": "data/drive/carboncapture.jpg",
		              "caption": "LANL's SimCCS software identifies cost-effective links between carbon sources (red dots) with storage sinks (blue dots) using pipelines (green lines).",
                      "title":"Making Cargon Capture Practical and Profitable"
		          },
                 "tubie":{
                    "header":"Consider this...",
                    "body":"What other seemingly small hurdles to better sustainability have been overcome with improved collaboration?"
                    }
		              	 	 	
		      },
             {
                 "header":"The CICE (pronounced \"sise\") computer model simulates the growth, melt, and movement of sea ice.",
                 "title": "Los Alamos sea ice model",
                 "body": "Elizabeth Hunke, lead developer of CICE, began development of the model at Los Alamos in 1994, with the first version being released in 1998.  Now on version 6.0 of CICE, Hunke states that \"our model is essential to helping agencies predict the polar sea conditions for developing infrastructure, shipping, and transportation plans.\"  \n\nCICE is now maintained and developed by the CICE Consortium, an international group of institutions in North America and Europe.  \n\nA key part of the Arctic predictive capability for the U.S. Navy, the National Oceanic and Atmospheric Association, and the National Ice Center, CICE is also widely used for earth-system research in academic and government institutions worldwide.",
		         "video":"data/videos/ModelingSeaIce.mp4",
                 "videoTitle":"Modeling sea ice has impact far beyond the poles",
                 "featuredMedia": {
		              "src": "data/drive/Elizabeth-Hunke-with-CICE-simulation.jpg",
		              "caption": "Elizabeth Hunke with a simulation of Arctic sea ice thickness produced by the Los Alamos sea ice model, CICE. Hunke’s work promotes a better understanding of how sea ice responds to and helps modulate the global climate.",
                      "title":"Modeling sea ice"
		          },
                  "tubie":{
                    "header":"Consider this...",
                    "body":"Many physical systems shape the world around us, even if they are not always apparent. What are some other physical systems, like sea ice, that shape the world you experience?"
                    }
		      },
             {
                 "title": "Coastal erosion",
                 "header":"As sea levels rise, the rapid erosion of US coastlines impacts national security, threatening power stations, water-treatment facilities, and military bases.",
                 "body": "Most extreme weather models do not take the threat into account.  The Los Alamos-developed NESMA (New Science for Multisector Adaptation) computer model uses complex algorithms (instructions that tell a computer how to solve a problem) and machine learning (the ability of a computer program to improve through experience, without needing to be programmed) to simulate the impact of coastline erosion on the infrastructure we depend upon.  \n\nHaving access to this information allows policy makers to prevent and reduce the severity of property damage, power outages, and other consequences of erosion.  According to Donatella Pasqualini, leader of the NeSMA team, the model forecasts \"every imaginable situation, which helps you understand the things you could do to best prepare.\"",
                 "video": "data/videos/ModelingErodingCoastlines.mp4",
                 "videoTitle":"Modeling eroding coastlines to prepare for hurricanes",
		          "featuredMedia": {
		              "src": "data/drive/seaice-2.jpg",
                      "title":"Modeling Eroding Coastlines to Prepare for Hurricanes"
		          },
                  "tubie":{
                    "header":"Consider this...",
                    "body":"How has being forewarned of a potential problem helped you prevent it, or at least keep it from becoming worse than it could have been?"
                    }
		      }
        ],
        "didYouKnow":
            [
                {
                "title":"Deflecting an asteroid",
                "header":"...That asteroids and other Near-Earth Objects vary wildly in composition, density, and behavior?",
                "body":"Knowing how to deflect a potential killer requires fast and accurate computer modeling for every object.",
                "video": "data/videos/VisualizationAnalysisThreats.mp4",
                "videoTitle":"Visualization and Analysis of Threats from Asteroid Ocean Impacts",
                "featuredMedia":{
                    "src": "data/drive/asteroid.jpg"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other technical challenges where a one-size-fits-all solution is not the best solution?"
                    }
                },
                {
                "title":"Cray-2",
                "header":"...That fluid-flow simulations on a Cray-2 supercomputer of the 1980s allowed Dow Chemical to design a disposable diaper that was superabsorbent, yet used less material (and sent less to the landfill) than previous diapers?",
                "body":"Supercomputers, like this iconic Cray-2 from the 1980s, have made many parts of our lives more sustainable without us realizing, including disposable diapers!",
                "featuredMedia":{
                    "src": "data/drive/cray2.jpg"
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other ways that computers have had a positive impact on sustainability in your life?"
                    }
                },
                {
                "title":"Real data for better models",
                "header":"...LANL’s Atmosphere, Climate, and Ecosystem Science Team (ACES) engages in experimental and observational research, from wildfire emissions to permafrost melting?",
                "body":"The collected data on real-world environmental processes is used to build and calibrate better computer models of the impacts of climate change, ensuring that LANL's climate models are accurate and reliable.",
                "featuredMedia":{
                    "src": "data/drive/ACES-team-members-sample-snow-pits.jpg",
                    "caption":"ACES team members sample snow pits to understand the interconnection of permafrost melting with changes in climate and the ecosystem."
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"What are some other areas where science and computing support each other?"
                    }
                },
                {
                "title":"Better climate models?\nJust add ice",
                "header":"...Supercomputers provide the number-crunching muscle to model the Earth’s complex global climate?",
                "body":"LANL scientists used the Lab’s supercomputers to couple multiple models of Antarctic ice-sheet movement to sharpen the predictive capabilities of global-climate models.  Predictive models improve our understanding of climate change, and help us mitigate its impact.",
                "featuredMedia":{
                    "src": "data/drive/Better-Climate-Models.jpg",
                    "caption":"Coupling ice-sheet models with climate models improves the predictive abilities of both."
                    },
                "tubie":{
                    "header":"Consider this...",
                    "body":"Understanding climate change is only the first step.  How can the predictive abilities of supercomputer models help us find solutions?"
                    }
                }
            ]
    }
}
