{
    "timeData":{
        "pageTitle":"High Performance Computing Technologies",
        "timeout":30000,
        "quitout":10000,
        "message":{
            "header":"Are you still there?",
            "body":"Please touch the screen in "
        },
        "videotimer":10000
    },
    
    "pageTubie":{
        "tubie_been":{
            "body":"As part of its national-security science mission, Los Alamos has a long history of creating cutting-edge computer hardware and software, both on its own, and in collaboration with HPC partners.  Explore some examples of Los Alamos driving HPC technologies forward."
        },
        "tubie_headed":{
            "body":"HPC technologies move fast, in more ways than one!  Learn more about the new and promising technologies that Los Alamos and the HPC industry are exploring and building to meet the computing challenges of tomorrow."
        }
    },
    "comp":{
        "header":"assets/customs/Title-HPCtech-noarrows.svg",
        "body":"If supercomputers are the tools, High-Performance Computing (HPC) is the application of those tools on computational problems that are too large or complex for ordinary computers.  The HPC field includes the people and organizations who take part in the advancement and application of supercomputers on a variety of scientific and engineering questions.\n\nExplore this panel to see the hard work and innovation that goes into making supercomputing truly super.",
        "been": {
            "button":"assets/customs/Title-LeftArrow-Been.svg",
            "body": "As part of its national-security science mission, Los Alamos has a long history of creating cutting-edge computer hardware and software, both on its own, and in collaboration with HPC partners.  Explore some examples of Los Alamos driving HPC technologies forward.",
            "slides": [
            {
                "video":"data/videos/LongHistorySupercomputing.mp4",
                "title":"A Long History of Supercomputing",
                "tubie":{
                    "body":"From bringing the first problem to the world's first electronic computer to building the first machine to break the petaflop barrier, Los Alamos holds many “firsts” in HPC breakthroughs.\nToday, supercomputers are integral to stockpile stewardship and the Laboratory continues to work with industry partners to develop the future of HPC."
                }
            },
            {
                "video":"data/videos/BigDataJustGotBigger.mp4",
                "title":"Big Data just got bigger",
                "tubie":{
                    "body":"Everything about a supercomputer is big; from its gargantuan size, to its vast number of processors.  Supercomputers also generate a lot of data, making it a growing challenge for scientists to find the information they need, much like searching for a needle in a very large haystack.  Los Alamos scientists and the Lab’s storage research team made history when they brought solutions from \"Big Data\" to the aid of \"Big Science.\""
                }
            },
            {
                "video":"data/videos/PreventingCyberZombieApocalypse.mp4",
                "title":"Preventing the cyber zombie apocalypse",
                "tubie":{
                    "body":"Cybercrime rates are on the rise, but what exactly does that mean? Cybercrime is any sort of crime using a computer—simple enough. And now that most people in the United States have a computer or access to one, cybercrime is more common than ever. Los Alamos National Laboratory has been working on cybersecurity techniques, processes, and tools to prevent and detect cyberattacks."
                }
            },
            {
                "video":"data/videos/LayeredSolutionSupercomputingStorage.mp4",
                "title":"A layered solution for supercomputing storage",
                "tubie":{
                    "body":"A major challenge in supercomputing is moving large amounts of simulation data off the computer and into storage.  This has to happen quickly enough to keep from wasting valuable computer processing time, but even the fastest hard-drive storage can't keep up with the huge volumes of data supercomputers generate today.  To solve this challenge, a team at Los Alamos developed two innovative memory management and storage technologies.  \"Burst buffers\" peel off data from the supercomputer's memory and place it onto solid-state drives (SSDs).  This allows the supercomputer to go back to work, while the SSDs send that data to inexpensive but slow spinning disk drives and tape archives, using new Lab-developed management software called MarFS to make the process seamless for the user. "
                }
            }
            ]
        },
        "headed": {
            "button":"assets/customs/Title-RightArrow-Headed.svg",
            "body": "HPC technologies move fast, in more ways than one!  Learn more about the new and promising technologies that Los Alamos and the HPC industry are exploring and building to meet the computing challenges of tomorrow.",
            "slides": [
            {
                "video":"data/videos/TheNextFrontierSupercomputing.mp4",
                "captions":[
                    {"file": "data/captions/Oceans_eng.vtt","label":"English","lang":"en"},
                    {"file": "data/captions/Oceans_eng.vtt","label":"French","lang":"fr"}
                ],
                "title":"The Next Frontier in Supercomputing",
                "tubie":{
                    "body":"The idea of building a computer as powerful as the human brain was once science-fiction, but it's become a reality with \"exascale.\"  Exascale supercomputers represent a thousand-fold performance increase over the most powerful computers of only a decade ago, but what exactly does \"exascale\" mean, and how is Los Alamos using these large-scale simulation resources to solve some of today’s most pressing problems?  Watch the video to find out!"
                }
            },
            {
                "video":"data/videos/oceans.mp4",
                "captions":[
                    {"file": "data/captions/Oceans_eng.vtt",
                     "label":"English",
                     "lang":"en"},
                    {"file": "data/captions/Oceans_eng.vtt",
                     "label":"French",
                     "lang":"fr"}
                ],
                "title":"What Makes a Quantum Computer Different",
                "tubie":{
                    "body":"A lot of buzz surrounds the new field of quantum computing, but how is a quantum computer different from the computers we have used for decades?  Watch the video to find out!"
                }
            },
            {
                "video":"data/videos/ScienceFirstBestPathQuantumSupremacy.mp4",
                "title":"\"Science First\" - The Best Path to Quantum Supremacy",
                "tubie":{
                    "body":"The potential of quantum computing seems limitless. \nIt promises faster internet searches, lightning-quick financial data analysis, shorter commutes, more effective cancer drugs, revolutionary new materials, and much more.  Los Alamos National Laboratory is finding ways to develop algorithms that get the most out of today’s very limited quantum computers."
                }
            },
            {
                "video":"data/videos/WorksBiologicallyRealisticComputerNetwork.mp4",
                "title":"Los Alamos works on a biologically realistic computer network",
                "tubie":{
                    "body":"How do the billions of small, biological \"switches,\" called neurons, in the brain store and process information, and how do they do it so efficiently?  Neuroscientists and computer scientists use supercomputers at Los Alamos to simulate how the brain operates, which could lead to more capable and efficient computers."
                }
            }
            ]
        }
    
    },
    
    "rd100": {
        "body":"R&D World magazine created the annual R&D 100 Awards in 1963 to recognize the top 100 product and technology innovations of each year.  179 Los Alamos R&D projects won the prestigious award between 1978 and 2019 alone.  Learn more about some of LANL's R&D 100 Award entries and winners for innovation in computing.",
        "qr":{
            "img":"data/rd100/bsm-lanl-rd100-qr-code-20220128.png",
            "text": "Scan QR code to see more R&D100 covers."
        },
        "covers":[
            {
                    "img":"data/rd100/R&D100icon-hardware.jpg",
                    "logo":"assets/customs/Title-HPChardware.svg",
                    "name":"Hard"
                },
                {
                    "img":"data/rd100/R&D100icon-networking.jpg",
                    "logo":"assets/customs/Title-HPCnetworking.svg",
                    "name":"Net"
                },
                {
                    "img":"data/rd100/R&D100icon-software.jpg",
                    "logo":"assets/customs/Title-HPCsoftware.svg",
                    "name":"Soft"
                }
        ],
        "hardware":[
            {
                "img":"data/rd100/R&D100icon-hardware.jpg",
                 "tubie":{
                    "body":"Can you think once considered?"
                }
            }
        ],
        "networking":[
            {
                "img":"data/rd100/R&D100icon-networking.jpg",
                "tubie":{
                    "body":"Can you think once considered?"
                }
            }
        ],
        "software":[
            {
                "img":"data/rd100/R&D100icon-software.jpg",
                "tubie":{
                    "body":"What other limited resources can be reused rather than discarded?"
                }
            }
        ]
    }
    
}